---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal3DOriginHandle(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/285b47be-01bf-546d-5ace-3f6d1654bd3d.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.SetGlobal3DOriginHandle Method

Sets the handle representing the 3D origin.

## Syntax (C#)
```csharp
public static void SetGlobal3DOriginHandle(
	IFCAnyHandle origin
)
```

## Parameters
- **origin** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The origin handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null